app/controllers/theaters_controller.rb

  def index
    @theaters = Theater.find(:all)
---
SELECT * FROM "theaters" WHERE ("theaters"."id" = 953125641)

  def show
    @theater = Theater.find(params[:id])
---
SELECT * FROM "theaters" WHERE ("theaters"."id" = 953125641)

  def edit
    @theater = Theater.find(params[:id])
---
SELECT * FROM "theaters" WHERE ("theaters"."id" = 953125641)

  def create
    @theater = Theater.new(params[:theater])

    respond_to do |format|
      if @theater.save
---
INSERT INTO "theaters" ("name", "address_city", "updated_at", "address_street", "address_zip", "address_state", "created_at") VALUES(NULL, NULL, '2009-04-21 01:45:42', NULL, NULL, NULL, '2009-04-21 01:45:42')

  def update
    @theater = Theater.find(params[:id])
---
SELECT * FROM "theaters" WHERE ("theaters"."id" = 953125641)

  def destroy
    @theater = Theater.find(params[:id])
    @theater.destroy
---
SELECT * FROM "theaters" WHERE ("theaters"."id" = 953125641)
DELETE FROM "theaters" WHERE "id" = 953125641